In [1]:
import numpy as np
import pandas as pd

In [2]:
labels =['a','b','c']
lists =[10,20,30]
arr = np.array([10,20,30])
d ={'a':1,'b':2,'c':3}

In [3]:
pd.Series(data=lists)

0    10
1    20
2    30
dtype: int64

In [111]:
pd.Series(data=lists,index=labels)

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [6]:
pd.Series(d)

a    1
b    2
c    3
dtype: int64

In [7]:
d

{'a': 1, 'b': 2, 'c': 3}

In [8]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [9]:
pd.Series([sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [20]:
ser1 = pd.Series([1,2,3,4],index=['USA','Japan','China','India'])

In [21]:
ser1

USA      1
Japan    2
China    3
India    4
dtype: int64

In [25]:
ser2 = pd.Series([1,2,7,6],index=['USA','German','England','France'])

In [26]:
ser2

USA        1
German     2
England    7
France     6
dtype: int64

In [27]:
ser1['USA']

1

In [28]:
ser1 + ser2

China      NaN
England    NaN
France     NaN
German     NaN
India      NaN
Japan      NaN
USA        2.0
dtype: float64

# DataFrame

In [30]:
from numpy.random import randn
np.random.seed(101)

In [31]:
df = pd.DataFrame(randn(5,4),index='a b c d e'.split(),columns='w x y z'.split())

In [32]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [35]:
df['w']

a    2.706850
b    0.651118
c   -2.018168
d    0.188695
e    0.190794
Name: w, dtype: float64

In [37]:
type(df)

pandas.core.frame.DataFrame

In [38]:
df[['w','z']]

          w         z
a  2.706850  0.503826
b  0.651118  0.605965
c -2.018168 -0.589001
d  0.188695  0.955057
e  0.190794  0.683509

In [39]:
#creatin gnew column

In [40]:
df['new'] = df['w'] + df ['x']

In [41]:
df

          w         x         y         z       new
a  2.706850  0.628133  0.907969  0.503826  3.334983
b  0.651118 -0.319318 -0.848077  0.605965  0.331800
c -2.018168  0.740122  0.528813 -0.589001 -1.278046
d  0.188695 -0.758872 -0.933237  0.955057 -0.570177
e  0.190794  1.978757  2.605967  0.683509  2.169552

In [42]:
#removing column

In [44]:
df.drop('new',axis=1)

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [45]:
df

          w         x         y         z       new
a  2.706850  0.628133  0.907969  0.503826  3.334983
b  0.651118 -0.319318 -0.848077  0.605965  0.331800
c -2.018168  0.740122  0.528813 -0.589001 -1.278046
d  0.188695 -0.758872 -0.933237  0.955057 -0.570177
e  0.190794  1.978757  2.605967  0.683509  2.169552

In [46]:
#tidak terhapus

In [47]:
df.drop('new',axis=1,inplace=True)

In [48]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [49]:
#drop the rows

In [53]:
df.drop('e',axis=0,inplace=True)

In [54]:
df.shape

(4, 4)

In [55]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057

In [56]:
#selecting rows

In [57]:
df.loc['a']

w    2.706850
x    0.628133
y    0.907969
z    0.503826
Name: a, dtype: float64

In [58]:
df.iloc[3]

w    0.188695
x   -0.758872
y   -0.933237
z    0.955057
Name: d, dtype: float64

In [59]:
df.iloc[0]

w    2.706850
x    0.628133
y    0.907969
z    0.503826
Name: a, dtype: float64

In [60]:
#subset of rows and columns

In [61]:
df.loc['a','y']

0.9079694464765431

In [62]:
df.loc[['a','c'],['w','x']]

          w         x
a  2.706850  0.628133
c -2.018168  0.740122

In [63]:
#condition selection

In [64]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057

In [74]:
df>0

       w      x      y      z
a   True   True   True   True
b   True  False  False   True
c  False   True   True  False
d   True  False  False   True

In [75]:
df[df>0]

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118       NaN       NaN  0.605965
c       NaN  0.740122  0.528813       NaN
d  0.188695       NaN       NaN  0.955057

In [78]:
df[df['w']>0]

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
d  0.188695 -0.758872 -0.933237  0.955057

In [79]:
booldf = df >0

In [80]:
booldf

       w      x      y      z
a   True   True   True   True
b   True  False  False   True
c  False   True   True  False
d   True  False  False   True

In [82]:
df[booldf]

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118       NaN       NaN  0.605965
c       NaN  0.740122  0.528813       NaN
d  0.188695       NaN       NaN  0.955057

In [83]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057

In [84]:
df['w']>0

a     True
b     True
c    False
d     True
Name: w, dtype: bool

In [85]:
df['w']

a    2.706850
b    0.651118
c   -2.018168
d    0.188695
Name: w, dtype: float64

In [86]:
df[df['w']>0]

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
d  0.188695 -0.758872 -0.933237  0.955057

In [87]:
df[df['z']<0]

          w         x         y         z
c -2.018168  0.740122  0.528813 -0.589001

In [88]:
booldf = df['w']>0

In [89]:
booldf

a     True
b     True
c    False
d     True
Name: w, dtype: bool

In [92]:
#cant use and operator,use & operator

df[(df['w']>0) & (df['y']>0)]

         w         x         y         z
a  2.70685  0.628133  0.907969  0.503826

In [94]:
df[(df['w']>0) | (df['y']>0)]

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057

In [95]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057

In [96]:
df.reset_index()

  index         w         x         y         z
0     a  2.706850  0.628133  0.907969  0.503826
1     b  0.651118 -0.319318 -0.848077  0.605965
2     c -2.018168  0.740122  0.528813 -0.589001
3     d  0.188695 -0.758872 -0.933237  0.955057

In [100]:
newind = 'CA NY HA OR'.split()

In [101]:
df['states'] = newind

In [102]:
df

          w         x         y         z states
a  2.706850  0.628133  0.907969  0.503826     CA
b  0.651118 -0.319318 -0.848077  0.605965     NY
c -2.018168  0.740122  0.528813 -0.589001     HA
d  0.188695 -0.758872 -0.933237  0.955057     OR

In [108]:
df.set_index('states',inplace=True)

In [109]:
df

               w         x         y         z
states
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
HA     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057